# 03. Basic SQL queries

In [2]:
# import libraries
import pandas as pd
import sqlite3

In [3]:
# connect the database
db = sqlite3.connect('database.sqlite')

In [4]:
# set a function for query
def run_query(query):
    return pd.read_sql_query(query,db)

In [4]:
# Select the table names
run_query("SELECT tbl_name FROM sqlite_master;")

  tbl_name
0  station
1   status
2     trip
3  weather

In [5]:
# First 5 rows of the trip table
run_query("SELECT * FROM trip LIMIT 5;")

,id,duration,start_date,start_station_name,start_station_id,end_date,end_station_name,end_station_id,bike_id,subscription_type,zip_code
0,4069,174,8/29/2013 9:08,2nd at South Park,64,8/29/2013 9:11,2nd at South Park,64,288,Subscriber,94114
1,4073,1067,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:42,San Francisco Caltrain 2 (330 Townsend),69,321,Subscriber,94703
2,4074,1131,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,317,Subscriber,94115
3,4075,1117,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,316,Subscriber,94122
4,4076,1118,8/29/2013 9:25,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,322,Subscriber,94597

In [6]:
# select specific columns
run_query("SELECT start_station_name, end_station_name, duration FROM trip LIMIT 5;")

         start_station_name                         end_station_name  duration
0         2nd at South Park                        2nd at South Park       174
1  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1067
2  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1131
3  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1117
4  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1118

In [8]:
# Filter using the WHERE keyword
query = "SELECT start_station_name, end_station_name, duration FROM trip WHERE start_station_name = 'Paseo de San Antonio' LIMIT 5;"
run_query(query)

     start_station_name                   end_station_name  duration
0  Paseo de San Antonio                   Adobe on Almaden     12280
1  Paseo de San Antonio  San Jose Diridon Caltrain Station       454
2  Paseo de San Antonio               Paseo de San Antonio      1481
3  Paseo de San Antonio               Paseo de San Antonio      1475
4  Paseo de San Antonio  San Jose Diridon Caltrain Station       573

In [9]:
# with boolean conditions

query ='''SELECT start_station_name, end_station_name, duration
          FROM trip
          WHERE duration < 100
          LIMIT 5;'''

run_query(query)

         start_station_name          end_station_name  duration
0   Mountain View City Hall   Mountain View City Hall        71
1        San Jose City Hall        San Jose City Hall        77
2  South Van Ness at Market            Market at 10th        83
3  South Van Ness at Market  South Van Ness at Market        63
4        San Jose City Hall        San Jose City Hall        70

In [10]:
# AND, OR, NOT
query= '''
SELECT start_station_name, end_station_name, duration
FROM trip
WHERE (duration < 100) AND (start_station_name = 'Paseo de San Antonio')
LIMIT 5;
'''

run_query(query)

     start_station_name      end_station_name  duration
0  Paseo de San Antonio  Paseo de San Antonio        87
1  Paseo de San Antonio  Paseo de San Antonio        69
2  Paseo de San Antonio  Paseo de San Antonio        94
3  Paseo de San Antonio  Paseo de San Antonio        82
4  Paseo de San Antonio  Paseo de San Antonio        65

In [11]:
# ORDER BY
query='''
SELECT start_station_name, end_station_name, duration
FROM trip
WHERE start_station_name = 'Paseo de San Antonio'
ORDER BY duration DESC
LIMIT 5;
'''

run_query(query)

     start_station_name        end_station_name  duration
0  Paseo de San Antonio               Japantown    288430
1  Paseo de San Antonio             MLK Library    167156
2  Paseo de San Antonio  SJSU 4th at San Carlos    127342
3  Paseo de San Antonio      San Jose City Hall     87387
4  Paseo de San Antonio      San Jose City Hall     87368

In [13]:
# Check info of tables
db.cursor().execute("PRAGMA table_info('trip')").fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'duration', 'INTEGER', 0, None, 0),
 (2, 'start_date', 'TEXT', 0, None, 0),
 (3, 'start_station_name', 'TEXT', 0, None, 0),
 (4, 'start_station_id', 'INTEGER', 0, None, 0),
 (5, 'end_date', 'TEXT', 0, None, 0),
 (6, 'end_station_name', 'TEXT', 0, None, 0),
 (7, 'end_station_id', 'INTEGER', 0, None, 0),
 (8, 'bike_id', 'INTEGER', 0, None, 0),
 (9, 'subscription_type', 'TEXT', 0, None, 0),
 (10, 'zip_code', 'INTEGER', 0, None, 0)]

Here above, if the last number of each line is a 1, that means that this is a primary key.

In [14]:
# temporarily change 'display.max_colwidth' in pandas
with pd.option_context('display.max_colwidth', 300):
    display(run_query("""SELECT sql FROM sqlite_master;"""))

                                                                                                                                                                                                                                                                                                           sql
0                                                                                                                               CREATE TABLE station (\n    id INTEGER PRIMARY KEY,\n    name TEXT,\n    lat NUMERIC,\n    long NUMERIC,\n    dock_count INTEGER,\n    city TEXT,\n    installation_date TEXT)
1                                                                                                                                                                                   CREATE TABLE status (\n    station_id INTEGER,\n    bikes_available INTEGER,\n    docks_available INTEGER,\n    time TEXT)
2  CREATE TABLE trip (\n    id INTEGER PRIMARY KEY,\n    duration INTEGER,\n    start_date TEXT,\n    start_station_name TEXT, -- this should be removed\n    start_station_id INTEGER,\n    end_date TEXT,\n    end_station_name TEXT, -- this should be removed\n    end_station_id INTEGER,\n    bike_id...
3  CREATE TABLE weather (\n    date TEXT,\n    max_temperature_f INTEGER,\n    mean_temperature_f INTEGER,\n    min_temperature_f INTEGER,\n    max_dew_point_f INTEGER,\n    mean_dew_point_f INTEGER,\n    min_dew_point_f INTEGER,\n    max_humidity INTEGER,\n    mean_humidity INTEGER,\n    min_humid...

# 04. Advanced SQL queries

In [15]:
# Aggregate Functions
run_query("SELECT AVG(duration) AS 'Average duration' FROM trip;")

   Average duration
0       1107.949846

## GROUP BY

In [16]:
query='''
SELECT subscription_type, AVG(duration) AS 'Average Duration'
FROM trip
GROUP BY subscription_type;'''

run_query(query)

  subscription_type  Average Duration
0          Customer       3951.761329
1        Subscriber        590.048856

## JOIN

In [18]:
query='''
SELECT station.city AS "City", COUNT(*) AS "Count"
FROM trip
INNER JOIN station
ON trip.start_station_name = station.name
GROUP BY station.city
ORDER BY Count DESC;'''

run_query(query)

            City   Count
0  San Francisco  592456
1       San Jose   37855
2  Mountain View   18167
3      Palo Alto    6773
4   Redwood City    3366

In [20]:
query = '''
SELECT start.city AS "Start city", end.city AS "End city", trip.duration
FROM trip
INNER JOIN station AS start
ON trip.start_station_name = start.name
INNER JOIN station as end
ON trip.end_station_name = end.name
WHERE start.city != end.city
ORDER BY duration DESC
LIMIT 1;'''

run_query(query)

  Start city       End city  duration
0  Palo Alto  Mountain View    611240

# 05. Exercise: SQL queries

In [24]:
#1
run_query("SELECT duration FROM trip ORDER BY duration DESC LIMIT 1;")

   duration
0  17270400

In [37]:
# 2
query= '''
SELECT end_station_name, COUNT(*) AS number_trips 
FROM trip
WHERE end_station_name == "2nd at South Park";
'''

run_query(query)

    end_station_name  number_trips
0  2nd at South Park         16843

In [38]:
# 3
query= '''
SELECT COUNT(*) AS btw_1000_2000
FROM trip
WHERE duration BETWEEN 1000 AND 2000;
'''

run_query(query)

   btw_1000_2000
0          56909

In [45]:
# 4
query='''
SELECT bike_id AS 'Bike', COUNT(*) AS 'Number of trips'
FROM trip
GROUP BY bike_id
ORDER BY COUNT(*) DESC
LIMIT 1;
'''

run_query(query)

   Bike  Number of trips
0   392             2061

In [47]:
# 5
query='''
SELECT start_station_name AS Station, COUNT(*) AS 'Number of trips'
FROM trip
WHERE start_station_name == end_station_name
GROUP BY start_station_name
ORDER BY COUNT(*) DESC
LIMIT 5;
'''

run_query(query)

                                Station  Number of trips
0                Embarcadero at Sansome             2092
1  Harry Bridges Plaza (Ferry Building)             1733
2                University and Emerson              894
3                         Market at 4th              724
4                       2nd at Townsend              683

# 06. Creating and modifying databases

In [48]:
# create empty database
db = sqlite3.connect("my_database.db")

In [49]:
# Create tables with names of table, names of columns and data type
query = 'CREATE TABLE customer (id INTEGER PRIMARY KEY, first_name TEXT, last_name TEXT, age INTEGER);'

#Create a cursor object
cursor = db.cursor()

In [50]:
# Query our table
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

In [51]:
results = cursor.fetchall()
print(results)

[('customer',)]

## Adding rows

In [56]:
query = "INSERT INTO customer VALUES (701, 'Mackenzie', 'Fox', 35)"
db.commit()

In [57]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35)]

## Adding columns

In [58]:
cursor.execute("ALTER TABLE customer ADD COLUMN city TEXT DEFAULT 'Geneva';")
db.commit()

In [59]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva')]

## Adding data from a pandas DataFrame

In [61]:
# creating dataframe
df2 = pd.DataFrame([[702, 'Emily', 'Joy', '49', 'Geneva']],
                  columns = ['id', 'first_name', 'last_name', 'age', 'city'])

In [62]:
# adding the row in our database
df2.to_sql(name='customer', con=db, if_exists='append', index=False)

In [63]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva'), (702, 'Emily', 'Joy', 49, 'Geneva')]

## Updating rows

In [64]:
update = '''
UPDATE customer
SET city="Zurich"
WHERE id=702;
'''

In [65]:
# execute the update
cursor.execute(update)
db.commit()

In [67]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva'), (702, 'Emily', 'Joy', 49, 'Zurich')]

## Deleting rows

In [68]:
delete = '''
DELETE FROM customer
WHERE id=702;'''

cursor.execute(delete)
db.commit()

In [69]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva')]

## Creating a database from a CSV file

In [70]:
# loading a csv file into a database is more efficient and faster
#create the database
db = sqlite3.connect('songs.db')
cursor = db.cursor()

In [71]:
# loading by chungs is more efficient for big data
for chunk in pd.read_csv("songs.csv", chunksize=4):
    chunk.to_sql(name="data", con=db, if_exists="append", index = False)
    print(chunk.iloc[0,2])

Stairway to Heaven
Black Dog
All My Love
Rebel Rebel
Golden Years

In [72]:
pd.read_sql_query('SELECT * FROM data;', db)

        Musician       Genre                        Name  Decade Minutes
0   Led Zeppelin   hard rock          Stairway to Heaven      70   08:02
1   Led Zeppelin   hard rock                     Kashmir      70   08:37
2   Led Zeppelin   hard rock              Immigrant Song      70   02:26
3   Led Zeppelin   hard rock            Whole Lotta Love      60   05:33
4   Led Zeppelin   hard rock                   Black Dog      70   04:55
5   Led Zeppelin   hard rock        Good Times Bad Times      60   02:43
6   Led Zeppelin   hard rock                   Moby Dick      60   04:25
7   Led Zeppelin   hard rock                   Ramble On      60   04:35
8   Led Zeppelin   hard rock                 All My Love      70   05:53
9   Led Zeppelin   hard rock  The Song Remains the Same       70   05:24
10  Led Zeppelin   hard rock       I Can't Quit You Baby      60   04:42
11   David Bowie    pop rock                Space Oddity      60   05:15
12   David Bowie    pop rock                 Rebel Rebel      70   04:22
13   David Bowie    pop rock              Under Pressure      80   04:08
14   David Bowie    pop rock                  China Girl      70   05:08
15   David Bowie    pop rock     I'm Afraid of Americans      90   05:00
16   David Bowie    pop rock                Golden Years      70   04:00
17     Bob Dylan  folk rock         Like a Rolling Stone      60   06:13
18     Bob Dylan  folk rock          Blowin' in the Wind      60   02:48
19     Bob Dylan  folk rock           Tangled Up in Blue      70   05:42

# 07. Exercise: the Consumer Finance Complaints data

### Task 1

In [80]:
db = sqlite3.connect('consumer_complaints.db')
cursor = db.cursor()

In [5]:
# loading by chungs is more efficient for big data
for chunk in pd.read_csv("consumer_complaints.csv", chunksize=500):
    chunk.to_sql(name="complaints", con=db, if_exists="append", index = False)

In [6]:
run_query("SELECT COUNT(*) FROM complaints")

   COUNT(*)
0     65499

### Task 2

In [21]:
query= '''
SELECT submitted_via AS Method, COUNT(*) AS Number
FROM complaints
GROUP BY submitted_via
ORDER BY COUNT(*) DESC
'''

run_query(query)

        Method  Number
0          Web   43947
1     Referral   10587
2        Phone    4974
3  Postal mail    4894
4          Fax    1076
5        Email      21

### Task 3

In [22]:
query= '''
SELECT submitted_via AS Method, COUNT(*) AS Number,
(SELECT COUNT(*) FROM complaints) AS Total
FROM complaints
GROUP BY submitted_via
ORDER BY COUNT(*) DESC
'''

run_query(query)

        Method  Number  Total
0          Web   43947  65499
1     Referral   10587  65499
2        Phone    4974  65499
3  Postal mail    4894  65499
4          Fax    1076  65499
5        Email      21  65499

#### Task 4

In [39]:
query= '''
SELECT *, (CAST (sub.Number AS double precision)/CAST (sub.Total AS double precision))* 100 AS 'Percent'
FROM (SELECT submitted_via AS Method, COUNT(*) AS Number,
(SELECT COUNT(*) FROM complaints) AS Total
FROM complaints
GROUP BY submitted_via
ORDER BY COUNT(*) DESC) sub;
'''

run_query(query)

        Method  Number  Total    Percent
0          Web   43947  65499  67.095681
1     Referral   10587  65499  16.163606
2        Phone    4974  65499   7.594009
3  Postal mail    4894  65499   7.471870
4          Fax    1076  65499   1.642773
5        Email      21  65499   0.032062